package org.dongguk.jjoin.domain.type;

public enum MajorType {
    AI소프트웨어융합학부, 데이터사이언스전공, 엔터테인먼트테크놀로지전공, 인공지능전공, 멀티미디어소프트웨어공학전공,
    컴퓨터공학전공, 경영정보학과, 경영학과, 회계학과, 경찰행정학부, 건설환경공학과, 건축공학부, 건축공학전공, 건축학전공,
    기계로봇에너지공학과, 산업시스템공학과, 융합에너지신소재공학과, 전자전기공학부, 화공생물공학과, 정보통신공학과, 교양학부,
    공공인재융합전공, 인텔리전스로봇융합전공, 국어국문문예창작학부, 국어국문학전공, 문예창작학전공, 사학과, 영어영문학부,
    영어문학전공, 영어통번역학전공, 일본학과, 중어중문학과, 철학과, 글로벌무역학과, 사회복지상담학과, 융합보안학과,
    바이오환경과학과, 생명과학과, 식품생명공학과, 의생명공학과, 법학과, 문화재학과, 불교학부, 가정교육과, 교육학과,
    국어교육과, 수학교육과, 역사교육과, 지리교육과,체육교육과,경제학과,광고홍보학과,국제통상학과,사회복지학과,미디어커뮤니케이션학전공,
    사회학전공,식품산업관리학과,북한학전공,정치외교학전공,행정학전공,약학과,뮤지컬전공,미술학부,불교미술전공,서양화전공,
    스포츠문화학과,연극전공,연극학부,영화영상학과,조소전공,한국화전공,한국음악과,물리반도체과학부,물리학전공,반도체과학전공,
    수학과,통계학과,화학과,
}
